leetcode_2437_number_of_valid_clock_times.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2437. Number of Valid Clock Times</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2437. Number of Valid Clock Times</h1>

<div id="outline-container-org648e309" class="outline-2">
<h2 id="org648e309">Understand the problem</h2>
<div class="outline-text-2" id="text-org648e309">
<p>
Count the number of valid time string by filling out the position with <code>?</code>.
</p>
</div>

<div id="outline-container-org245c9a2" class="outline-3">
<h3 id="org245c9a2">Useful prompts</h3>
<div class="outline-text-3" id="text-org245c9a2">
<ul class="org-ul">
<li><a href="can_we_use_brute_force_to_solve_the_problem.html#ID-29512D97-A54D-42F9-A8C7-C3422881933B">Can we use brute-force to solve the problem?</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5262c9e" class="outline-2">
<h2 id="org5262c9e">Devise a plan</h2>
<div class="outline-text-2" id="text-org5262c9e">
<p>
In this problem, the <a href="pattern_small_constraints_could_allow_brute_force_solution.html#ID-BC81A358-FBCC-43AA-9928-E9778A107869">Pattern: Small constraints could allow a brute-force solution</a>.  For each unknown position, we try to fill with numbers from 0 to 9.  On the end, we count 1 if the time is valid or 0 otherwise.  Time complexity is \(O(9^4)=O(1)\) and space is \(O(1)\).
</p>
</div>

<div id="outline-container-org455eeda" class="outline-3">
<h3 id="org455eeda">Carry out the plan</h3>
<div class="outline-text-3" id="text-org455eeda">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">countTime</span>(<span style="font-weight: bold;">self</span>, time: <span style="font-weight: bold;">str</span>) -&gt; <span style="font-weight: bold;">int</span>:
        <span style="font-weight: bold;">if</span> <span style="font-style: italic;">"?"</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">in</span> time:
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">int</span>(0 &lt;= <span style="font-weight: bold;">int</span>(time[:2]) &lt;= 23 <span style="font-weight: bold;">and</span> 0 &lt;= <span style="font-weight: bold;">int</span>(time[3:]) &lt;= 59)
        <span style="font-weight: bold; font-style: italic;">i</span> = time.find(<span style="font-style: italic;">"?"</span>)
        <span style="font-weight: bold; font-style: italic;">ans</span> = 0
        <span style="font-weight: bold;">for</span> d <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">ord</span>(<span style="font-style: italic;">"0"</span>), <span style="font-weight: bold;">ord</span>(<span style="font-style: italic;">"9"</span>) + 1):
            <span style="font-weight: bold; font-style: italic;">ans</span> += <span style="font-weight: bold;">self</span>.countTime(time[:i] + <span style="font-weight: bold;">chr</span>(d) + time[i + 1 :])
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>